[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:112:46
               id="submitterEmail"
               type="email"
               isInvalid={Boolean(errors.submitterEmail)}
-              {...register("submitterEmail", {
-                required: "Submitter Email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Email must be valid.",
-                },
-              })}
+              {...register("submitterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messages on missing input
statusReason: Unable to find an element with the text: /Submitter Email is required\./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
      novalidate=""

[Killed] OptionalChaining
main/components/Articles/ArticlesForm.jsx:121:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.submitterEmail?.message}
+              {errors.submitterEmail.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'message')
