[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:36:5
   };
 
   const columns = [
-    {
-      header: "ID",
-      accessorKey: "id",
-    },
+    {},
     {
       header: "Title",
killedBy: ArticlesTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:37:15
 
   const columns = [
     {
-      header: "ID",
+      header: "",
       accessorKey: "id",
     },
killedBy: ArticlesTable tests renders empty table correctly
statusReason: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:38:20
   const columns = [
     {
       header: "ID",
-      accessorKey: "id",
+      accessorKey: "",
     },
     {
killedBy: ArticlesTable tests renders data correctly for admin
statusReason: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:54:20
     },
     {
       header: "Submitter Email",
-      accessorKey: "submitterEmail",
+      accessorKey: "",
     },
     {
killedBy: ArticlesTable tests renders data correctly for admin
statusReason: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-submitterEmail"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"
