[Killed] StringLiteral
main/pages/Articles/ArticlesEditPage.jsx:20:12
     {
       // Stryker disable next-line all : GET is the default, mutating this adds no value
       method: "GET",
-      url: "/api/articles",
+      url: "",
       params: { id },
     },
killedBy: ArticlesEditPage tests tests where backend is working normally is populated with the data provided and submits updates
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Articles/ArticlesEditPage.jsx:25:34
     },
   );
 
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      submitterEmail: article.submitterEmail,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally is populated with the data provided and submits updates
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 5 title: How to deploy an app on Dokku",

[Killed] ObjectLiteral
main/pages/Articles/ArticlesEditPage.jsx:25:48
     },
   );
 
-  const objectToAxiosPutParams = (article) => ({
-    url: "/api/articles",
-    method: "PUT",
-    params: {
-      id: article.id,
-    },
-    data: {
-      title: article.title,
-      url: article.url,
-      explanation: article.explanation,
-      submitterEmail: article.submitterEmail,
-      dateAdded: article.dateAdded,
-    },
-  });
+  const objectToAxiosPutParams = (article) => ({});
 
   const onSuccess = (article) => {
killedBy: ArticlesEditPage tests tests where backend is working normally is populated with the data provided and submits updates
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Article Updated - id: 5 title: How to deploy an app on Dokku",

[Killed] ConditionalExpression
main/pages/Articles/ArticlesEditPage.jsx:65:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Article</h1>
-        {article && (
-          <ArticlesForm
-            submitAction={onSubmit}
-            buttonLabel="Update"
-            initialContents={article}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: ArticlesEditPage tests tests where backend is working normally is populated with the data provided and submits updates
statusReason: Unable to find an element by: [data-testid="ArticlesForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
