[Killed] StringLiteral
main/components/RestaurantRecommendation/RecommendationRequestForm.jsx:18:24
   } = useForm({ defaultValues: initialContents || {} });
   // Stryker restore all
   const navigate = useNavigate();
-  const testIdPrefix = "RecommendationRequestForm";
+  const testIdPrefix = "";
 
   // Same ISO datetime regex used in UCSBDateForm
killedBy: RecommendationRequestForm tests renders correctly when passing in a RecommendationRequest
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RestaurantRecommendation/RecommendationRequestForm.jsx:49:42
           id="requesterEmail"
           type="text"
           isInvalid={Boolean(errors.requesterEmail)}
-          {...register("requesterEmail", {
-            required: "RequesterEmail is required.",
-            maxLength: { value: 255, message: "Max length 255 characters" },
-          })}
+          {...register("requesterEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Max length validations on text fields
statusReason: expected 2 to be greater than or equal to 3

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ObjectLiteral
main/components/RestaurantRecommendation/RecommendationRequestForm.jsx:66:42
           id="professorEmail"
           type="text"
           isInvalid={Boolean(errors.professorEmail)}
-          {...register("professorEmail", {
-            required: "ProfessorEmail is required.",
-            maxLength: { value: 255, message: "Max length 255 characters" },
-          })}
+          {...register("professorEmail", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Max length validations on text fields
statusReason: expected 2 to be greater than or equal to 3

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/RestaurantRecommendation/RecommendationRequestForm.jsx:68:47
           isInvalid={Boolean(errors.professorEmail)}
           {...register("professorEmail", {
             required: "ProfessorEmail is required.",
-            maxLength: { value: 255, message: "Max length 255 characters" },
+            maxLength: { value: 255, message: "" },
           })}
         />
killedBy: RecommendationRequestForm tests Max length validations on text fields
statusReason: expected 2 to be greater than or equal to 3

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] StringLiteral
main/components/RestaurantRecommendation/RecommendationRequestForm.jsx:85:47
           isInvalid={Boolean(errors.explanation)}
           {...register("explanation", {
             required: "Explanation is required.",
-            maxLength: { value: 255, message: "Max length 255 characters" },
+            maxLength: { value: 255, message: "" },
           })}
         />
killedBy: RecommendationRequestForm tests Max length validations on text fields
statusReason: expected 2 to be greater than or equal to 3

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form

[Killed] ObjectLiteral
main/components/RestaurantRecommendation/RecommendationRequestForm.jsx:85:24
           isInvalid={Boolean(errors.explanation)}
           {...register("explanation", {
             required: "Explanation is required.",
-            maxLength: { value: 255, message: "Max length 255 characters" },
+            maxLength: {},
           })}
         />
killedBy: RecommendationRequestForm tests Max length validations on text fields
statusReason: expected 2 to be greater than or equal to 3

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <form
