[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:21:15
       // Stryker disable next-line all : GET is default, so mutating to "" doesn't change behavior
       method: "GET",
       url: "/api/recommendationrequests",
-      params: { id },
+      params: {},
     },
   );
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:25:34
     },
   );
 
-  const objectToAxiosPutParams = (rr) => ({
-    url: "/api/recommendationrequests",
-    method: "PUT",
-    params: { id: rr.id },
-    data: {
-      requesterEmail: rr.requesterEmail,
-      professorEmail: rr.professorEmail,
-      explanation: rr.explanation,
-      dateRequested: rr.dateRequested,
-      dateNeeded: rr.dateNeeded,
-      done: rr.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (rr) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "RecommendationRequest Updated - id: 17 requesterEmail: alice@ucsb.edu",

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestEditPage.jsx:27:13
 
   const objectToAxiosPutParams = (rr) => ({
     url: "/api/recommendationrequests",
-    method: "PUT",
+    method: "",
     params: { id: rr.id },
     data: {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected +0 to be 1 // Object.is equality
