[Killed] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/menuitemreviews`,
-      params: { id },
+      params: {},
     },
   );
killedBy: MenuItemReviewEditPage tests tests where backend is working normally renders without crashing
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.jsx:26:34
     },
   );
 
-  const objectToAxiosPutParams = (menuitemreview) => ({
-    url: "/api/menuitemreviews",
-    method: "PUT",
-    params: { id: menuitemreview.id },
-    data: {
-      itemId: menuitemreview.itemId,
-      reviewerEmail: menuitemreview.reviewerEmail,
-      stars: menuitemreview.stars,
-      dateReviewed: menuitemreview.dateReviewed,
-      comments: menuitemreview.comments,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (_response, menuitemreview) => {
killedBy: MenuItemReviewEditPage tests tests where backend is working normally Changes when you click Update
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "MenuItemReview Updated - id: 17 itemId: 2 reviewerEmail: test2@test.com stars: 4 dateReviewed: 2022-01-03T00:00 comments: test comment 2",
