[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:23:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-              <Form.Control
-                data-testid="UCSBOrganizationForm-orgCode"
-                id="orgCode"
-                type="text"
-                {...register("orgCode")}
-                value={initialContents.orgCode}
-                readOnly
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         {!initialContents && (
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:23:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-              <Form.Control
-                data-testid="UCSBOrganizationForm-orgCode"
-                id="orgCode"
-                type="text"
-                {...register("orgCode")}
-                value={initialContents.orgCode}
-                readOnly
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
+              <Form.Control data-testid="UCSBOrganizationForm-orgCode" id="orgCode" type="text" {...register("orgCode")} value={initialContents.orgCode} readOnly />
+            </Form.Group>
+          </Col>}
 
         {!initialContents && (
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:39:10
           </Col>
         )}
 
-        {!initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="orgCode">Organization Code</Form.Label>
-              <Form.Control
-                data-testid="UCSBOrganizationForm-orgCode"
-                id="orgCode"
-                type="text"
-                isInvalid={Boolean(errors.orgCode)}
-                {...register("orgCode", {
-                  required: "Organization Code is required.",
-                })}
-              />
-              <Form.Control.Feedback type="invalid">
-                {errors.orgCode?.message}
-              </Form.Control.Feedback>
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col>
killedBy: UCSBOrganizationCreatePage tests renders without crashing
statusReason: Unable to find a label with the text of: Organization Code

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
