[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:133:24
           label="Solved"
           id="solved"
           data-testid={testIdPrefix + "-solved"}
-          {...register("solved")}
+          {...register("")}
         />
       </Form.Group>
killedBy: HelpRequestForm tests renders correctly with no initialContents
statusReason: Cannot read properties of undefined (reading '_f')
