[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemForm.jsx:45:45
           id="diningCommonsCode"
           type="text"
           isInvalid={Boolean(errors.diningCommonsCode)}
-          {...register("diningCommonsCode", {
-            required: "DiningCommonsCode is required.",
-            maxLength: {
-              value: 255,
-              message: "Max length 255 characters",
-            },
-          })}
+          {...register("diningCommonsCode", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /DiningCommonsCode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
