[Killed] BlockStatement
src/main/utils/UCSBDiningCommonsMenuItemUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/UCSBDiningCommonsMenuItems",
-    method: "DELETE",
-    params: {
-      id: cell.row.original.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBDiningCommonsMenuItemTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
src/main/utils/UCSBDiningCommonsMenuItemUtils.js:10:10
 
 export function cellToAxiosParamsDelete(cell) {
   return {
-    url: "/api/UCSBDiningCommonsMenuItems",
+    url: "",
     method: "DELETE",
     params: {
killedBy: UCSBDiningCommonsMenuItemUtils cellToAxiosParamsDelete It returns the correct params
statusReason: expected { url: '', method: 'DELETE', …(1) } to deeply equal { …(3) }
