[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuitemreview) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: menuitemreview.itemId,
-      reviewerEmail: menuitemreview.reviewerEmail,
-      stars: menuitemreview.stars,
-      dateReviewed: menuitemreview.dateReviewed,
-      comments: menuitemreview.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuitemreview) => {
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:9:10
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
   const objectToAxiosParams = (menuitemreview) => ({
-    url: "/api/menuitemreviews/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "New menu item review Created - id: 1 itemId: 1 reviewerEmail: test@test.com stars: 1 dateReviewed: 2022-01-03T00:00 comments: test comment",
